Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim1.h
#define TIM1_CCMR1_IC2F                     (0xFU<<12U)
#define TIM1_CCMR1_IC2F_0                   (0x1U<<12U)
#define TIM1_CCMR1_IC2PSC                   (0x3U<<10U)
#define TIM1_CCMR1_IC2PSC_0                 (0x1U<<10U)
#define TIM1_CCMR1_CC2S                     (0x3U<<8U)
#define TIM1_CCMR1_CC2S_0                   (0x1U<<8U)
#define TIM1_CCMR1_IC1F                     (0xFU<<4U)
#define TIM1_CCMR1_IC1F_0                   (0x1U<<4U)
#define TIM1_CCMR1_IC1PSC                   (0x3U<<2U)
#define TIM1_CCMR1_IC1PSC_0                 (0x1U<<2U)
#define TIM1_CCMR1_CC1S                     (0x3U<<0U)
#define TIM1_CCMR1_CC1S_0                   (0x1U<<0U)
#define TIM1_CCMR1_CC2S_B_0X0               (0x0U<<8U)
#define TIM1_CCMR1_CC2S_B_0X1               (0x1U<<8U)
#define TIM1_CCMR1_CC2S_B_0X2               (0x2U<<8U)
#define TIM1_CCMR1_CC2S_B_0X3               (0x3U<<8U)
#define TIM1_CCMR1_IC1F_B_0X0               (0x0U<<4U)
#define TIM1_CCMR1_IC1F_B_0X1               (0x1U<<4U)
#define TIM1_CCMR1_IC1F_B_0X2               (0x2U<<4U)
#define TIM1_CCMR1_IC1F_B_0X3               (0x3U<<4U)
#define TIM1_CCMR1_IC1F_B_0X4               (0x4U<<4U)
#define TIM1_CCMR1_IC1F_B_0X5               (0x5U<<4U)
#define TIM1_CCMR1_IC1F_B_0X6               (0x6U<<4U)
#define TIM1_CCMR1_IC1F_B_0X7               (0x7U<<4U)
#define TIM1_CCMR1_IC1F_B_0X8               (0x8U<<4U)
#define TIM1_CCMR1_IC1F_B_0X9               (0x9U<<4U)
#define TIM1_CCMR1_IC1F_B_0XA               (0xAU<<4U)
#define TIM1_CCMR1_IC1F_B_0XB               (0xBU<<4U)
#define TIM1_CCMR1_IC1F_B_0XC               (0xCU<<4U)
#define TIM1_CCMR1_IC1F_B_0XD               (0xDU<<4U)
#define TIM1_CCMR1_IC1F_B_0XE               (0xEU<<4U)
#define TIM1_CCMR1_IC1F_B_0XF               (0xFU<<4U)
#define TIM1_CCMR1_IC1PSC_B_0X0             (0x0U<<2U)
#define TIM1_CCMR1_IC1PSC_B_0X1             (0x1U<<2U)
#define TIM1_CCMR1_IC1PSC_B_0X2             (0x2U<<2U)
#define TIM1_CCMR1_IC1PSC_B_0X3             (0x3U<<2U)
#define TIM1_CCMR1_CC1S_B_0X0               (0x0U<<0U)
#define TIM1_CCMR1_CC1S_B_0X1               (0x1U<<0U)
#define TIM1_CCMR1_CC1S_B_0X2               (0x2U<<0U)
#define TIM1_CCMR1_CC1S_B_0X3               (0x3U<<0U)

// CCMR1_ALTERNATE1 Configuration

#define TIM1_CCMR1_ALTERNATE1_OC2M_1        (0x1U<<24U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_1        (0x1U<<16U)
#define TIM1_CCMR1_ALTERNATE1_OC2CE         (0x1U<<15U)
#define TIM1_CCMR1_ALTERNATE1_OC2M          (0x7U<<12U)
#define TIM1_CCMR1_ALTERNATE1_OC2M_0        (0x1U<<12U)
#define TIM1_CCMR1_ALTERNATE1_OC2PE         (0x1U<<11U)
#define TIM1_CCMR1_ALTERNATE1_OC2FE         (0x1U<<10U)
#define TIM1_CCMR1_ALTERNATE1_CC2S          (0x3U<<8U)
#define TIM1_CCMR1_ALTERNATE1_CC2S_0        (0x1U<<8U)
#define TIM1_CCMR1_ALTERNATE1_OC1CE         (0x1U<<7U)
#define TIM1_CCMR1_ALTERNATE1_OC1M          (0x7U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_0        (0x1U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1PE         (0x1U<<3U)
#define TIM1_CCMR1_ALTERNATE1_OC1FE         (0x1U<<2U)
#define TIM1_CCMR1_ALTERNATE1_CC1S          (0x3U<<0U)
#define TIM1_CCMR1_ALTERNATE1_CC1S_0        (0x1U<<0U)
#define TIM1_CCMR1_ALTERNATE1_CC2S_B_0X0    (0x0U<<8U)
#define TIM1_CCMR1_ALTERNATE1_CC2S_B_0X1    (0x1U<<8U)
#define TIM1_CCMR1_ALTERNATE1_CC2S_B_0X2    (0x2U<<8U)
#define TIM1_CCMR1_ALTERNATE1_CC2S_B_0X3    (0x3U<<8U)
#define TIM1_CCMR1_ALTERNATE1_OC1CE_B_0X0   (0x0U<<7U)
#define TIM1_CCMR1_ALTERNATE1_OC1CE_B_0X1   (0x1U<<7U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X0    (0x0U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X1    (0x1U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X2    (0x2U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X3    (0x3U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X4    (0x4U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X5    (0x5U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X6    (0x6U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1M_B_0X7    (0x7U<<4U)
#define TIM1_CCMR1_ALTERNATE1_OC1PE_B_0X0   (0x0U<<3U)
#define TIM1_CCMR1_ALTERNATE1_OC1PE_B_0X1   (0x1U<<3U)
#define TIM1_CCMR1_ALTERNATE1_OC1FE_B_0X0   (0x0U<<2U)
#define TIM1_CCMR1_ALTERNATE1_OC1FE_B_0X1   (0x1U<<2U)
#define TIM1_CCMR1_ALTERNATE1_CC1S_B_0X0    (0x0U<<0U)
#define TIM1_CCMR1_ALTERNATE1_CC1S_B_0X1    (0x1U<<0U)
#define TIM1_CCMR1_ALTERNATE1_CC1S_B_0X2    (0x2U<<0U)
#define TIM1_CCMR1_ALTERNATE1_CC1S_B_0X3    (0x3U<<0U)

// CCMR2 Configuration

#define TIM1_CCMR2_IC4F                     (0xFU<<12U)
#define TIM1_CCMR2_IC4F_0                   (0x1U<<12U)
#define TIM1_CCMR2_IC4PSC                   (0x3U<<10U)
#define TIM1_CCMR2_IC4PSC_0                 (0x1U<<10U)
#define TIM1_CCMR2_CC4S                     (0x3U<<8U)
#define TIM1_CCMR2_CC4S_0                   (0x1U<<8U)
#define TIM1_CCMR2_IC3F                     (0xFU<<4U)
#define TIM1_CCMR2_IC3F_0                   (0x1U<<4U)
#define TIM1_CCMR2_IC3PSC                   (0x3U<<2U)
#define TIM1_CCMR2_IC3PSC_0                 (0x1U<<2U)
#define TIM1_CCMR2_CC3S                     (0x3U<<0U)
#define TIM1_CCMR2_CC3S_0                   (0x1U<<0U)
#define TIM1_CCMR2_CC4S_B_0X0               (0x0U<<8U)
#define TIM1_CCMR2_CC4S_B_0X1               (0x1U<<8U)
#define TIM1_CCMR2_CC4S_B_0X2               (0x2U<<8U)
#define TIM1_CCMR2_CC4S_B_0X3               (0x3U<<8U)
#define TIM1_CCMR2_CC3S_B_0X0               (0x0U<<0U)
#define TIM1_CCMR2_CC3S_B_0X1               (0x1U<<0U)
#define TIM1_CCMR2_CC3S_B_0X2               (0x2U<<0U)
#define TIM1_CCMR2_CC3S_B_0X3               (0x3U<<0U)

// CCMR2_ALTERNATE Configuration

#define TIM1_CCMR2_ALTERNATE_OC4M_1         (0x1U<<24U)
#define TIM1_CCMR2_ALTERNATE_OC3M_1         (0x1U<<16U)
#define TIM1_CCMR2_ALTERNATE_OC4CE          (0x1U<<15U)
#define TIM1_CCMR2_ALTERNATE_OC4M           (0x7U<<12U)
#define TIM1_CCMR2_ALTERNATE_OC4M_0         (0x1U<<12U)
#define TIM1_CCMR2_ALTERNATE_OC4PE          (0x1U<<11U)
#define TIM1_CCMR2_ALTERNATE_OC4FE          (0x1U<<10U)
#define TIM1_CCMR2_ALTERNATE_CC4S           (0x3U<<8U)
#define TIM1_CCMR2_ALTERNATE_CC4S_0         (0x1U<<8U)
#define TIM1_CCMR2_ALTERNATE_OC3CE          (0x1U<<7U)
#define TIM1_CCMR2_ALTERNATE_OC3M           (0x7U<<4U)
#define TIM1_CCMR2_ALTERNATE_OC3M_0         (0x1U<<4U)
#define TIM1_CCMR2_ALTERNATE_OC3PE          (0x1U<<3U)
#define TIM1_CCMR2_ALTERNATE_OC3FE          (0x1U<<2U)
#define TIM1_CCMR2_ALTERNATE_CC3S           (0x3U<<0U)
#define TIM1_CCMR2_ALTERNATE_CC3S_0         (0x1U<<0U)
#define TIM1_CCMR2_ALTERNATE_CC4S_B_0X0     (0x0U<<8U)
#define TIM1_CCMR2_ALTERNATE_CC4S_B_0X1     (0x1U<<8U)
#define TIM1_CCMR2_ALTERNATE_CC4S_B_0X2     (0x2U<<8U)
#define TIM1_CCMR2_ALTERNATE_CC4S_B_0X3     (0x3U<<8U)
#define TIM1_CCMR2_ALTERNATE_CC3S_B_0X0     (0x0U<<0U)
#define TIM1_CCMR2_ALTERNATE_CC3S_B_0X1     (0x1U<<0U)
#define TIM1_CCMR2_ALTERNATE_CC3S_B_0X2     (0x2U<<0U)
#define TIM1_CCMR2_ALTERNATE_CC3S_B_0X3     (0x3U<<0U)

// CCER Configuration

#define TIM1_CCER_CC6P                      (0x1U<<21U)
#define TIM1_CCER_CC6E                      (0x1U<<20U)
#define TIM1_CCER_CC5P                      (0x1U<<17U)
#define TIM1_CCER_CC5E                      (0x1U<<16U)
#define TIM1_CCER_CC4NP                     (0x1U<<15U)
#define TIM1_CCER_CC4P                      (0x1U<<13U)
#define TIM1_CCER_CC4E                      (0x1U<<12U)
#define TIM1_CCER_CC3NP                     (0x1U<<11U)
#define TIM1_CCER_CC3NE                     (0x1U<<10U)
#define TIM1_CCER_CC3P                      (0x1U<<9U)
#define TIM1_CCER_CC3E                      (0x1U<<8U)
#define TIM1_CCER_CC2NP                     (0x1U<<7U)
#define TIM1_CCER_CC2NE                     (0x1U<<6U)
#define TIM1_CCER_CC2P                      (0x1U<<5U)
#define TIM1_CCER_CC2E                      (0x1U<<4U)
#define TIM1_CCER_CC1NP                     (0x1U<<3U)
#define TIM1_CCER_CC1NE                     (0x1U<<2U)
#define TIM1_CCER_CC1P                      (0x1U<<1U)
#define TIM1_CCER_CC1E                      (0x1U<<0U)
#define TIM1_CCER_CC1NP_B_0X0               (0x0U<<3U)
#define TIM1_CCER_CC1NP_B_0X1               (0x1U<<3U)
#define TIM1_CCER_CC1NE_B_0X0               (0x0U<<2U)
#define TIM1_CCER_CC1NE_B_0X1               (0x1U<<2U)
#define TIM1_CCER_CC1P_B_0X0                (0x0U<<1U)
#define TIM1_CCER_CC1P_B_0X1                (0x1U<<1U)
#define TIM1_CCER_CC1E_B_0X0                (0x0U<<0U)
#define TIM1_CCER_CC1E_B_0X1                (0x1U<<0U)

// CNT Configuration

