Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim1.h
#define TIM1_CNT_UIFCPY                     (0x1U<<31U)
#define TIM1_CNT_CNT                        (0xFFFFU<<0U)
#define TIM1_CNT_CNT_0                      (0x1U<<0U)

// PSC Configuration

#define TIM1_PSC_PSC                        (0xFFFFU<<0U)
#define TIM1_PSC_PSC_0                      (0x1U<<0U)

// ARR Configuration

#define TIM1_ARR_ARR                        (0xFFFFU<<0U)
#define TIM1_ARR_ARR_0                      (0x1U<<0U)

// RCR Configuration

#define TIM1_RCR_REP                        (0xFFFFU<<0U)
#define TIM1_RCR_REP_0                      (0x1U<<0U)

// CCR1 Configuration

#define TIM1_CCR1_CCR1                      (0xFFFFU<<0U)
#define TIM1_CCR1_CCR1_0                    (0x1U<<0U)

// CCR2 Configuration

#define TIM1_CCR2_CCR2                      (0xFFFFU<<0U)
#define TIM1_CCR2_CCR2_0                    (0x1U<<0U)

// CCR3 Configuration

#define TIM1_CCR3_CCR3                      (0xFFFFU<<0U)
#define TIM1_CCR3_CCR3_0                    (0x1U<<0U)

// CCR4 Configuration

#define TIM1_CCR4_CCR4                      (0xFFFFU<<0U)
#define TIM1_CCR4_CCR4_0                    (0x1U<<0U)

// BDTR Configuration

#define TIM1_BDTR_BK2P                      (0x1U<<25U)
#define TIM1_BDTR_BK2E                      (0x1U<<24U)
#define TIM1_BDTR_BK2F                      (0xFU<<20U)
#define TIM1_BDTR_BK2F_0                    (0x1U<<20U)
#define TIM1_BDTR_BKF                       (0xFU<<16U)
#define TIM1_BDTR_BKF_0                     (0x1U<<16U)
#define TIM1_BDTR_MOE                       (0x1U<<15U)
#define TIM1_BDTR_AOE                       (0x1U<<14U)
#define TIM1_BDTR_BKP                       (0x1U<<13U)
#define TIM1_BDTR_BKE                       (0x1U<<12U)
#define TIM1_BDTR_OSSR                      (0x1U<<11U)
#define TIM1_BDTR_OSSI                      (0x1U<<10U)
#define TIM1_BDTR_LOCK                      (0x3U<<8U)
#define TIM1_BDTR_LOCK_0                    (0x1U<<8U)
#define TIM1_BDTR_DTG                       (0xFFU<<0U)
#define TIM1_BDTR_DTG_0                     (0x1U<<0U)
#define TIM1_BDTR_BK2P_B_0X0                (0x0U<<25U)
#define TIM1_BDTR_BK2P_B_0X1                (0x1U<<25U)
#define TIM1_BDTR_BK2E_B_0X0                (0x0U<<24U)
#define TIM1_BDTR_BK2E_B_0X1                (0x1U<<24U)
#define TIM1_BDTR_BK2F_B_0X0                (0x0U<<20U)
#define TIM1_BDTR_BK2F_B_0X1                (0x1U<<20U)
#define TIM1_BDTR_BK2F_B_0X2                (0x2U<<20U)
#define TIM1_BDTR_BK2F_B_0X3                (0x3U<<20U)
#define TIM1_BDTR_BK2F_B_0X4                (0x4U<<20U)
#define TIM1_BDTR_BK2F_B_0X5                (0x5U<<20U)
#define TIM1_BDTR_BK2F_B_0X6                (0x6U<<20U)
#define TIM1_BDTR_BK2F_B_0X7                (0x7U<<20U)
#define TIM1_BDTR_BK2F_B_0X8                (0x8U<<20U)
#define TIM1_BDTR_BK2F_B_0X9                (0x9U<<20U)
#define TIM1_BDTR_BK2F_B_0XA                (0xAU<<20U)
#define TIM1_BDTR_BK2F_B_0XB                (0xBU<<20U)
#define TIM1_BDTR_BK2F_B_0XC                (0xCU<<20U)
#define TIM1_BDTR_BK2F_B_0XD                (0xDU<<20U)
#define TIM1_BDTR_BK2F_B_0XE                (0xEU<<20U)
#define TIM1_BDTR_BK2F_B_0XF                (0xFU<<20U)
#define TIM1_BDTR_BKF_B_0X0                 (0x0U<<16U)
#define TIM1_BDTR_BKF_B_0X1                 (0x1U<<16U)
#define TIM1_BDTR_BKF_B_0X2                 (0x2U<<16U)
#define TIM1_BDTR_BKF_B_0X3                 (0x3U<<16U)
#define TIM1_BDTR_BKF_B_0X4                 (0x4U<<16U)
#define TIM1_BDTR_BKF_B_0X5                 (0x5U<<16U)
#define TIM1_BDTR_BKF_B_0X6                 (0x6U<<16U)
#define TIM1_BDTR_BKF_B_0X7                 (0x7U<<16U)
#define TIM1_BDTR_BKF_B_0X8                 (0x8U<<16U)
#define TIM1_BDTR_BKF_B_0X9                 (0x9U<<16U)
#define TIM1_BDTR_BKF_B_0XA                 (0xAU<<16U)
#define TIM1_BDTR_BKF_B_0XB                 (0xBU<<16U)
#define TIM1_BDTR_BKF_B_0XC                 (0xCU<<16U)
#define TIM1_BDTR_BKF_B_0XD                 (0xDU<<16U)
#define TIM1_BDTR_BKF_B_0XE                 (0xEU<<16U)
#define TIM1_BDTR_BKF_B_0XF                 (0xFU<<16U)
#define TIM1_BDTR_MOE_B_0X0                 (0x0U<<15U)
#define TIM1_BDTR_MOE_B_0X1                 (0x1U<<15U)
#define TIM1_BDTR_AOE_B_0X0                 (0x0U<<14U)
#define TIM1_BDTR_AOE_B_0X1                 (0x1U<<14U)
#define TIM1_BDTR_BKP_B_0X0                 (0x0U<<13U)
#define TIM1_BDTR_BKP_B_0X1                 (0x1U<<13U)
#define TIM1_BDTR_BKE_B_0X0                 (0x0U<<12U)
#define TIM1_BDTR_BKE_B_0X1                 (0x1U<<12U)
#define TIM1_BDTR_OSSR_B_0X0                (0x0U<<11U)
#define TIM1_BDTR_OSSR_B_0X1                (0x1U<<11U)
#define TIM1_BDTR_OSSI_B_0X0                (0x0U<<10U)
#define TIM1_BDTR_OSSI_B_0X1                (0x1U<<10U)
#define TIM1_BDTR_LOCK_B_0X0                (0x0U<<8U)
#define TIM1_BDTR_LOCK_B_0X1                (0x1U<<8U)
#define TIM1_BDTR_LOCK_B_0X2                (0x2U<<8U)
#define TIM1_BDTR_LOCK_B_0X3                (0x3U<<8U)

// DCR Configuration

#define TIM1_DCR_DBL                        (0x1FU<<8U)
#define TIM1_DCR_DBL_0                      (0x1U<<8U)
#define TIM1_DCR_DBA                        (0x1FU<<0U)
#define TIM1_DCR_DBA_0                      (0x1U<<0U)
#define TIM1_DCR_DBL_B_0X0                  (0x0U<<8U)
#define TIM1_DCR_DBL_B_0X1                  (0x1U<<8U)
#define TIM1_DCR_DBL_B_0X2                  (0x2U<<8U)
#define TIM1_DCR_DBL_B_0X11                 (0x11U<<8U)
#define TIM1_DCR_DBA_B_0X0                  (0x0U<<0U)
#define TIM1_DCR_DBA_B_0X1                  (0x1U<<0U)
#define TIM1_DCR_DBA_B_0X2                  (0x2U<<0U)

// DMAR Configuration

#define TIM1_DMAR_DMAB                      (0xFFFFFFFFU<<0U)
#define TIM1_DMAR_DMAB_0                    (0x1U<<0U)

// CCMR3 Configuration

#define TIM1_CCMR3_OC6M_1                   (0x1U<<24U)
#define TIM1_CCMR3_OC5M_1                   (0x1U<<16U)
#define TIM1_CCMR3_OC6CE                    (0x1U<<15U)
#define TIM1_CCMR3_OC6M                     (0x7U<<12U)
#define TIM1_CCMR3_OC6M_0                   (0x1U<<12U)
#define TIM1_CCMR3_OC6PE                    (0x1U<<11U)
#define TIM1_CCMR3_OC6FE                    (0x1U<<10U)
#define TIM1_CCMR3_OC5CE                    (0x1U<<7U)
#define TIM1_CCMR3_OC5M                     (0x7U<<4U)
#define TIM1_CCMR3_OC5M_0                   (0x1U<<4U)
#define TIM1_CCMR3_OC5PE                    (0x1U<<3U)
#define TIM1_CCMR3_OC5FE                    (0x1U<<2U)

